Revit 2027 API
TessellatedShapeBuilder.AddFace Method
 Adds a face to the currently open connected face set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddFace(
	TessellatedFace face
)
Public Sub AddFace (
	face As TessellatedFace
)
public:
void AddFace(
	TessellatedFace^ face
)
member AddFace :
        face : TessellatedFace -> unit
Parameters
face TessellatedFace
 Face to add. The 'face' parameter can be added only once, as its boundary loops will be cleared while adding and 'face' will become unusable.
Exceptions
Exception | Condition
ArgumentException |  The 'face' does not have enough loops and/or vertices to be valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  A face set is closed and faces cannot be added to it.
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace